#include "Tapdev.h"
#include "uip.h"
#include "dm9000x.h"

extern void etherdev_init(void);
/*---------------------------------------------------------------------------*/
/* 配置网卡硬件，设置IP地址 */
void tapdev_init(void)
{
  etherdev_init();
}

/****************************************************************************
* 名    称：uint16_t tapdev_read(void)
* 功    能：																		 
* 入口参数：读取一包数据
* 出口参数: 如果一个数据包收到返回数据包长度，以字节为单位，否则为零。
* 说    明：
* 调用方法：
****************************************************************************/ 
uint16_t tapdev_read(void)
{	
  return  dm9000x_receivepacket(uip_buf, UIP_BUFSIZE);
}
/****************************************************************************
* 名    称：void tapdev_send(void)
* 功    能：																		 
* 入口参数：发送一包数据
* 出口参数: 
* 说    明：
* 调用方法：
****************************************************************************/ 
void tapdev_send(void)
{
  dm9000x_sendpacket(uip_buf, uip_len);
}

/*---------------------------------------------------------------------------*/
